{
  "appName": { "message": "minify.js" },
  "appCopyright": { "message": "© 2024–2026 Adam Lui และผู้ร่วมให้ข้อมูลภายใต้ใบอนุญาต MIT" },
  "prefix_error": { "message": "ผิดพลาด" },
  "prefix_globalVer": { "message": "เวอร์ชันส่วนกลาง" },
  "prefix_localVer": { "message": "เวอร์ชันในเครื่อง" },
  "prefix_source": { "message": "ภาษาต้นทาง" },
  "error_notRecognized": { "message": "ไม่ได้รับการยอมรับ" },
  "error_invalidURL": { "message": "URL ไม่ถูกต้อง" },
  "error_firstArgNotExist": { "message": "อาร์กิวเมนต์แรกต้องเป็นไฟล์หรือไดเรกทอรีที่มีอยู่เท่านั้น" },
  "error_doesNotExist": { "message": "ไม่มี" },
  "info_validArgs": { "message": "อาร์กิวเมนต์ที่ถูกต้องอยู่ด้านล่าง" },
  "info_exampleValidCmd": { "message": "ตัวอย่างคำสั่งที่ถูกต้อง" },
  "info_filesToBeMinned": { "message": "ไฟล์จาวาสคริปต์ที่จะถูกย่อ" },
  "info_noFilesWillBeMinned": { "message": "ไม่มีไฟล์ JavaScript จะถูกทำให้เล็กลง" },
  "info_copying": { "message": "กำลังคัดลอกไปยังคลิปบอร์ด" },
  "info_writing": { "message": "กำลังเขียนไปยังไฟล์" },
  "info_minComplete": { "message": "การย่อเสร็จสมบูรณ์" },
  "info_file": { "message": "ไฟล์" },
  "info_mininified": { "message": "minified" },
  "info_noFilesProcessed": { "message": "ไม่มีการประมวลผลไฟล์จาวาสคริปต์ที่ยังไม่ได้" },
  "info_failedToMinify": { "message": "ล้มเหลวในการลดขนาด" },
  "info_moreHelp": { "message": "หากต้องการความช่วยเหลือเพิ่มเติม" },
  "info_visit": { "message": "การเยือน \" - State Visit การเยือนอย่างเป็นทางการในระดับประมุขของรัฐ หมายถึง การเยือนของบุคคลสำคัญของต่างประเทศในระดับประมุขของรัฐ ที่มีสถานะเป็นกษัตริย์หรือประธานาธิบดี โดยเป็นการเยือนอย่างเป็นทางการในฐานะแขกของรัฐผู้รับ รัฐผู้รับจะจัดพิธีการต้อนรับอย่างเป็นทางการเต็มรูปแบบ - Official Visit การเยือนอย่างเป็นทางการในฐานะแขกของ รัฐบาล หมายถึง การเยือนเป็นทางการของประมุขของรัฐ มกุฎราชกุมาร หัวหน้ารัฐบาล หรือหัวหน้าองค์การระหว่างประเทศที่มีตำแหน่ง เทียบเท่า โดยเป็นแขกรับเชิญของรัฐบาล และจัดพิธีการรับรองต่าง ๆ อย่างเป็นทางการเต็มรูปแบบ - Visit as Guest of the Royal Thai Government การเยือนในฐานะแขกของรัฐบาล หมายถึง การเยือนของประมุขของรัฐ หัวหน้ารัฐบาลและหัวหน้า องค์การระหว่างประเทศที่มีตำแหน่งเทียบเท่าซึ่งไม่ได้เดินทางมาเยือนอย่าง เป็นทางการหรือเพื่อเจรจาทำงาน รวมทั้งการเสด็จฯ เยือนของพระราชวงศ์ รองประธานาธิบดีและบุคคลสำคัญอื่น ๆ ที่มีตำแหน่งเทียบเท่า ซึ่งรัฐบาลไทยปรารถนาที่จะแสดงไมตรีจิตโดยเชิญให้มาเยือนประเทศไทยในฐานะแขก ของรัฐบาล และจัดการต้อนรับให้ เหมาะสมและสอดคล้องกับวัตถุประสงค์ของการเยือนในแต่ละกรณี - Working Visit การเยือนเพื่อเจรจาทำงาน หมายถึง การเยือนของบุคคลสำคัญจากต่างประเทศในระดับประมุขของรัฐ หัวหน้ารัฐบาล และหัวหน้าองค์การระหว่างประเทศที่มีตำแหน่งเทียบเท่าที่มีจุดมุ่งหมายเพื่อ เจรจาในปัญหาหรือประเด็นใดเป็นการเฉพาะในระยะเวลาอันสั้น - Visit as Guest of Their Majesties the King and Queen of Thailand การเยือนในฐานะพระราชอาคันตุกะส่วนพระองค์ หมายถึง การเสด็จเยือนของพระราชวงศ์ต่างประเทศ หรือการเยือนของบุคคลสำคัญจากต่างประเทศ ในฐานะพระราชอาคันตุกะส่วน พระองค์ของพระบาทสมเด็จพระเจ้าอยู่หัวและสมเด็จพระนางเจ้าฯ พระบรมราชินีนาถ - Private Visit การเยือนส่วนตัวหรือแวะผ่าน หมายถึง การเยือนของบุคคลสำคัญจากต่างประเทศในระดับประมุขของรัฐ พระราชวงศ์ หัวหน้ารัฐบาล หรือผู้นำองค์การระหว่างประเทศที่มีตำแหน่งเทียบเท่า และบุคคลสำคัญอื่น ๆ ที่มีจุดมุ่งหมายเพื่อเยือนเป็นการส่วนตัวหรือการแวะผ่านประเทศในระยะเวลา อันสั้น รัฐผู้รับจะจัดการอำนวยความสะดวกต่าง ๆ ให้ตามความเหมาะสม \"" },
  "helpSection_usage": { "message": "การใช้งาน" },
  "helpSection_pathArgs": { "message": "อาร์กิวเมนต์เส้นทาง" },
  "helpSection_flags": { "message": "ตัวเลือกบูลีน" },
  "helpSection_paramOptions": { "message": "ตัวเลือกพารามิเตอร์" },
  "helpSection_infoCmds": { "message": "คำสั่งข้อมูล" },
  "inputPathDesc_main": { "message": "พาธไปยังไฟล์ JavaScript หรือไดเรกทอรีที่มีไฟล์ JavaScript ที่จะย่อ" },
  "inputPathDesc_extra": { "message": "สัมพันธ์กับไดเรกทอรีการทำงานปัจจุบัน" },
  "outputPathDesc_main": { "message": "พาธไปยังไฟล์หรือไดเรกทอรีที่จะจัดเก็บไฟล์ที่ถูกย่อ" },
  "outputPathDesc_extra": { "message": "สัมพันธ์กับตำแหน่งไฟล์ต้นฉบับ (หากไม่มีให้จะใช้ขั้นต่ำ/ถูกใช้)" },
  "optionDesc_dryRun": { "message": "อย่าย่อขนาดไฟล์เพียงแค่แสดงว่าไฟล์เหล่านั้นจะได้รับการประมวลผลหรือไม่" },
  "optionDesc_dotfolders": { "message": "รวมโฟลเดอร์จุดในการค้นหาไฟล์" },
  "optionDesc_dotfiles": { "message": "รวมดอทไฟล์ในการค้นหาไฟล์" },
  "optionDesc_noRecursion": { "message": "ปิดใช้งานการค้นหาไฟล์ที่เกิดซ้ำ" },
  "optionDesc_noMangle": { "message": "ปิดใช้งานชื่อ mangling" },
  "optionDesc_noFilenameChange": { "message": "ปิดใช้งานการเปลี่ยนนามสกุลไฟล์เป็น .min.js" },
  "optionDesc_copy": { "message": "คัดลอกรหัสย่อไปยังคลิปบอร์ดแทนการเขียนไปยังไฟล์หากมีการประมวลผลไฟล์แหล่งที่มาเดียว" },
  "optionDesc_relativeOutput": { "message": "ไฟล์เอาต์พุตที่สัมพันธ์กับไฟล์ต้นทางแต่ละไฟล์แทนที่จะเป็นรากอินพุต" },
  "optionDesc_rewriteImports": { "message": "อัปเดตเส้นทางการนำเข้าจาก .js เป็น .min.js" },
  "optionDesc_quiet": { "message": "ระงับการบันทึกทั้งหมดยกเว้นข้อผิดพลาด" },
  "optionDesc_ignores": { "message": "ไฟล์/ไดเรกทอรีที่จะแยกออกจากการย่อ" },
  "optionDesc_commentMain": { "message": "แสดงความคิดเห็นส่วนหัวล่วงหน้าไปยังรหัสย่อ" },
  "optionDesc_commentExtra": { "message": "แยกตามบรรทัดโดยใช้ '\\n'" },
  "optionDesc_help": { "message": "หน้าจอวิธีใช้การแสดงผล" },
  "optionDesc_version": { "message": "à¸à¸·à¹à¸­à¸à¸­à¸à¸£à¸°à¸à¸à¹à¸ªà¸à¸à¸à¸¥" }
}
