{
  "appName": { "message": "scss-to-css" },
  "appCopyright": { "message": "© 2024 -2026 Adam Lui และผู้ร่วมให้ข้อมูลภายใต้ใบอนุญาต MIT" },
  "prefix_error": { "message": "ผิดพลาด" },
  "prefix_tip": { "message": "เคล็ดลับ" },
  "prefix_warning": { "message": "คำเตือน" },
  "prefix_globalVer": { "message": "เวอร์ชันส่วนกลาง" },
  "prefix_localVer": { "message": "เวอร์ชันในเครื่อง" },
  "prefix_source": { "message": "ที่มา" },
  "error_readingLocalPkgVer": { "message": "เกิดข้อผิดพลาดในการอ่านเวอร์ชันแพคเก" },
  "error_notRecognized": { "message": "ไม่ได้รับการยอมรับ" },
  "error_nonPositiveNum": { "message": "อาร์กิวเมนต์สามารถเป็น > 0 เท่านั้น" },
  "error_invalidURL": { "message": "URL ไม่ถูกต้อง" },
  "error_invalidConfigFile": { "message": "ไฟล์การกำหนดค่าต้องส่งออกออบเจ็กต์" },
  "error_configFileNotFound": { "message": "ไม่พบไฟล์การกำหนดค่า" },
  "error_failedToLoadConfigFile": { "message": "โหลดไฟล์การกำหนดค่าไม่สำเร็จ" },
  "error_mustIncludePath": { "message": "ต้องมี = เส้นทาง" },
  "warn_configFileExists": { "message": "มีไฟล์การกำหนดค่าอยู่แล้ว" },
  "info_exampleValidConfigFile": { "message": "ตัวอย่างไฟล์การกำหนดค่าที่ถูกต้อง" },
  "error_firstArgNotExist": { "message": "อาร์กิวเมนต์แรกต้องเป็นไฟล์หรือไดเรกทอรีที่มีอยู่เท่านั้น" },
  "error_doesNotExist": { "message": " ไม่มี" },
  "info_exampleValidCmd": { "message": "ตัวอย่างคำสั่งที่ถูกต้อง" },
  "info_scssFilesToBeCompiled": { "message": "ไฟล์ SCSS ที่จะคอมไพล์" },
  "info_noSCSSfilesWillBeCompiled": { "message": "จะไม่มีการคอมไพล์ไฟล์ SCSS" },
  "info_copyingToClip": { "message": "กำลังคัดลอกไปยังคลิปบอร์ด" },
  "info_writing": { "message": "กำลังเขียนไปยังไฟล์" },
  "info_compilationComplete": { "message": "การคอมไพล์เสร็จสมบูรณ์" },
  "info_file": { "message": "ไฟล์" },
  "info_srcMap": { "message": "แผนที่ต้นทาง" },
  "info_generated": { "message": "สร้าง" },
  "info_noSCSSfilesProcessed": { "message": "ไม่มีการประมวลผลไฟล์ SCSS" },
  "info_failedToCompile": { "message": "ล้มเหลวในการคอมไพล์ '%1'" },
  "info_moreHelp": { "message": "หากต้องการความช่วยเหลือเพิ่มเติม" },
  "info_type": { "message": "ประเภท" },
  "info_or": { "message": "หรือ" },
  "info_visit": { "message": "การเยือน \" - State Visit การเยือนอย่างเป็นทางการในระดับประมุขของรัฐ หมายถึง การเยือนของบุคคลสำคัญของต่างประเทศในระดับประมุขของรัฐ ที่มีสถานะเป็นกษัตริย์หรือประธานาธิบดี โดยเป็นการเยือนอย่างเป็นทางการในฐานะแขกของรัฐผู้รับ รัฐผู้รับจะจัดพิธีการต้อนรับอย่างเป็นทางการเต็มรูปแบบ - Official Visit การเยือนอย่างเป็นทางการในฐานะแขกของ รัฐบาล หมายถึง การเยือนเป็นทางการของประมุขของรัฐ มกุฎราชกุมาร หัวหน้ารัฐบาล หรือหัวหน้าองค์การระหว่างประเทศที่มีตำแหน่ง เทียบเท่า โดยเป็นแขกรับเชิญของรัฐบาล และจัดพิธีการรับรองต่าง ๆ อย่างเป็นทางการเต็มรูปแบบ - Visit as Guest of the Royal Thai Government การเยือนในฐานะแขกของรัฐบาล หมายถึง การเยือนของประมุขของรัฐ หัวหน้ารัฐบาลและหัวหน้า องค์การระหว่างประเทศที่มีตำแหน่งเทียบเท่าซึ่งไม่ได้เดินทางมาเยือนอย่าง เป็นทางการหรือเพื่อเจรจาทำงาน รวมทั้งการเสด็จฯ เยือนของพระราชวงศ์ รองประธานาธิบดีและบุคคลสำคัญอื่น ๆ ที่มีตำแหน่งเทียบเท่า ซึ่งรัฐบาลไทยปรารถนาที่จะแสดงไมตรีจิตโดยเชิญให้มาเยือนประเทศไทยในฐานะแขก ของรัฐบาล และจัดการต้อนรับให้ เหมาะสมและสอดคล้องกับวัตถุประสงค์ของการเยือนในแต่ละกรณี - Working Visit การเยือนเพื่อเจรจาทำงาน หมายถึง การเยือนของบุคคลสำคัญจากต่างประเทศในระดับประมุขของรัฐ หัวหน้ารัฐบาล และหัวหน้าองค์การระหว่างประเทศที่มีตำแหน่งเทียบเท่าที่มีจุดมุ่งหมายเพื่อ เจรจาในปัญหาหรือประเด็นใดเป็นการเฉพาะในระยะเวลาอันสั้น - Visit as Guest of Their Majesties the King and Queen of Thailand การเยือนในฐานะพระราชอาคันตุกะส่วนพระองค์ หมายถึง การเสด็จเยือนของพระราชวงศ์ต่างประเทศ หรือการเยือนของบุคคลสำคัญจากต่างประเทศ ในฐานะพระราชอาคันตุกะส่วน พระองค์ของพระบาทสมเด็จพระเจ้าอยู่หัวและสมเด็จพระนางเจ้าฯ พระบรมราชินีนาถ - Private Visit การเยือนส่วนตัวหรือแวะผ่าน หมายถึง การเยือนของบุคคลสำคัญจากต่างประเทศในระดับประมุขของรัฐ พระราชวงศ์ หัวหน้ารัฐบาล หรือผู้นำองค์การระหว่างประเทศที่มีตำแหน่งเทียบเท่า และบุคคลสำคัญอื่น ๆ ที่มีจุดมุ่งหมายเพื่อเยือนเป็นการส่วนตัวหรือการแวะผ่านประเทศในระยะเวลา อันสั้น รัฐผู้รับจะจัดการอำนวยความสะดวกต่าง ๆ ให้ตามความเหมาะสม \"" },
  "info_configFileCreated": { "message": "สร้างไฟล์การกำหนดค่าแล้ว" },
  "info_fetchingRemoteConfigFrom": { "message": "กำลังเรียกไฟล์การกำหนดค่าระยะไกลจาก" },
  "warn_remoteConfigNotFound": { "message": "ไม่พบไฟล์การกำหนดค่าระยะไกล" },
  "warn_remoteConfigFailed": { "message": "เรียกดูไฟล์การกำหนดค่าระยะไกลไม่สำเร็จ" },
  "tip_editToSetDefaults": { "message": "แก้ไขไฟล์นี้เพื่อปรับแต่งค่าเริ่มต้น" },
  "tip_cliArgsPrioritized": { "message": "อาร์กิวเมนต์ CLI แทนที่ค่าเหล่านี้เสมอ" },
  "helpSection_usage": { "message": "การใช้งาน" },
  "helpSection_pathArgs": { "message": "อาร์กิวเมนต์เส้นทาง" },
  "helpSection_flags": { "message": "ตัวเลือกบูลีน" },
  "helpSection_params": { "message": "ตัวเลือกพารามิเตอร์" },
  "helpSection_cmds": { "message": "à¸à¸³à¸ªà¸±à¹à¸" },
  "inputPathDesc_main": { "message": "เส้นทางไปยังไฟล์ SCSS หรือไดเรกทอรีที่มีไฟล์ SCSS ที่จะคอมไพล์" },
  "inputPathDesc_extra": { "message": "สัมพันธ์กับไดเรกทอรีการทำงานปัจจุบัน" },
  "outputPathDesc_main": { "message": "เส้นทางไปยังไฟล์หรือไดเรกทอรีที่จะจัดเก็บไฟล์ CSS + sourcemap" },
  "outputPathDesc_extra": { "message": "สัมพันธ์กับรากอินพุต (หากไม่มีให้ใช้ css/)" },
  "optionDesc_dryRun": { "message": "อย่าคอมไพล์ไฟล์จริงๆเพียงแค่แสดงว่าไฟล์เหล่านั้นจะได้รับการประมวลผลหรือไม่" },
  "optionDesc_dotfolders": { "message": "รวมโฟลเดอร์จุดในการค้นหาไฟล์" },
  "optionDesc_noSourceMaps": { "message": "ป้องกันไม่ให้สร้างแผนที่ต้นทาง" },
  "optionDesc_noMinify": { "message": "ปิดใช้งานการลดขนาด CSS เอาต์พุต" },
  "optionDesc_noRecursion": { "message": "ปิดใช้งานการค้นหาไฟล์ที่เกิดซ้ำ" },
  "optionDesc_copy": { "message": "คัดลอก CSS ที่คอมไพล์ไปยังคลิปบอร์ดแทนการเขียนไปยังไฟล์หากประมวลผลไฟล์แหล่งที่มาเดียว" },
  "optionDesc_relativeOutput": { "message": "ไฟล์เอาต์พุตที่สัมพันธ์กับไฟล์ต้นทางแต่ละไฟล์แทนที่จะเป็นรากอินพุต" },
  "optionDesc_quiet": { "message": "ระงับการบันทึกทั้งหมดยกเว้นข้อผิดพลาด" },
  "optionDesc_ignores": { "message": "ไฟล์/ไดเรกทอรีที่จะแยกออกจากการคอมไพล์" },
  "optionDesc_commentMain": { "message": "เตรียมความคิดเห็นส่วนหัวเพื่อรวบรวม CSS" },
  "optionDesc_commentExtra": { "message": "แยกตามบรรทัดโดยใช้ '\\ n '" },
  "optionDesc_config": { "message": "โหลดไฟล์การกำหนดค่าที่กำหนดเอง" },
  "optionDesc_init": { "message": "สร้างไฟล์การกำหนดค่า (ในรูทโครงการ)" },
  "optionDesc_help": { "message": "หน้าจอวิธีใช้การแสดงผล" },
  "optionDesc_version": { "message": "à¸à¸·à¹à¸­à¸à¸­à¸à¸£à¸°à¸à¸à¹à¸ªà¸à¸à¸à¸¥" }
}
